In [1]:
import pandas as pd

In [2]:
# Load resumes from Excel file
df = pd.read_excel('resumes.xlsx')

# Show the data
df.head()

           Name                                        Resume Text
0      John Doe  Experienced Python developer with machine lear...
1    Jane Smith  Project manager with leadership and agile expe...
2  Alex Johnson  Data analyst skilled in SQL, Python, and data ...

In [3]:
# Define your keywords
keywords = ['python', 'machine learning', 'sql', 'data analysis']

In [4]:
# Function to score each resume
def score_resume(resume):
    resume = str(resume).lower()
    score = sum([1 for word in keywords if word in resume])
    return score

# Apply scoring to each resume
df['Score'] = df['Resume Text'].apply(score_resume)

# Show results
df

           Name                                        Resume Text  Score
0      John Doe  Experienced Python developer with machine lear...      2
1    Jane Smith  Project manager with leadership and agile expe...      0
2  Alex Johnson  Data analyst skilled in SQL, Python, and data ...      2

In [5]:
# Save the results to a new Excel file
df.to_excel('resume_screening_results.xlsx', index=False)

print("Results saved to 'resume_screening_results.xlsx'")

Results saved to 'resume_screening_results.xlsx'